InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеНаСчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПлатежаСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ИнтеграцияССайтомGKHINUA/Ext/Module.bsl
// ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИИ
Функция ОплатаПоСоцтраху(ЛС, ПериодНачисления)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПоступлениеНаСчет.СуммаДокумента,
	    |	ПоступлениеНаСчет.ВидНачисления,
	    |	ПоступлениеНаСчет.Дата
	    |ИЗ
	    |	Документ.ПоступлениеНаСчет КАК ПоступлениеНаСчет
	    |ГДЕ
	    |	ПоступлениеНаСчет.Проведен = ИСТИНА
	    |	И ПоступлениеНаСчет.ЛицевойСчет = &ЛицевойСчет";
		//|	И ПоступлениеНаСчет.Дата МЕЖДУ &НачПериода И &КонПериода";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	//Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ПериодНачисления));
	//Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ПериодНачисления));
	
	Результат = Запрос.Выполнить();
	Соцстрах = Новый Структура;
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Соцстрах.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
			Соцстрах.Вставить("ВидНачисления", Выборка.ВидНачисления);
			Соцстрах.Вставить("Дата", Выборка.Дата);
		КонецЦикла;
	Иначе
		Соцстрах.Вставить("СуммаДокумента", "");
		Соцстрах.Вставить("ВидНачисления", "");
	КонецЕсли;
	Возврат Соцстрах;
КонецФункции

Функция ДанныеПоЛС(ЛицевыеСчета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.Услуга,
	    |	НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги КАК ВидУслуги,
	    |	НазначенныеУслугиСрезПоследних.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет = &ЛицевойСчет
	    |				И Действует = ИСТИНА) КАК НазначенныеУслугиСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевыеСчета);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Функция ЛицевойСчетПоGUID(УИД) Экспорт
	НовыйGUID = Новый УникальныйИдентификатор(УИД);
	ЛС = Справочники.ЛицевыеСчета.ПолучитьСсылку(НовыйGUID);
	Возврат ЛС;
КонецФункции

Функция ПриборУчетаПоGUID(УИД) Экспорт
	НовыйGUID = Новый УникальныйИдентификатор(УИД);
	Прибор = Справочники.ПриборыУчета.ПолучитьСсылку(НовыйGUID);
	Возврат Прибор;
КонецФункции


///////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ ФУНКЦИИ ДЛЯ ВЫГРУЗКИ

// Дані абонентів – фізичних осіб
Функция ВыборкаЛицевыхСчетов(CODE) Экспорт
	тзЛС = Новый ТаблицаЗначений;
	тзЛС.Колонки.Добавить("ACCOUNT_CODE");                  //Унікальний ідентифікатор (УІД) особового рахунку абонента
	тзЛС.Колонки.Добавить("ACCOUNT_NUMBER");                //Номер особового рахунку
	тзЛС.Колонки.Добавить("ACCOUNT_STATE");                 //Стан особового рахунку   active – відкритий о/р, closed – закритий о/р
	тзЛС.Колонки.Добавить("LOCALITY_CODE");                 //Код КОАТУУ населеного пункту
	тзЛС.Колонки.Добавить("DISTRICT_CODE");                 //Код КОАТУУ району населеного пункту
	тзЛС.Колонки.Добавить("AREA_NAME");                     //Назва місцевості
	тзЛС.Колонки.Добавить("STREET_TYPE");                   //Скорочене найменування типу вулиці
	тзЛС.Колонки.Добавить("STREET_NAME");                   //Найменування вулиці
	тзЛС.Колонки.Добавить("BUILDING_POST_CODE");            //Поштовий індекс
	тзЛС.Колонки.Добавить("BUILDING_ENTRANCES_N");          //Кількість під’їздів в будинку
	тзЛС.Колонки.Добавить("BUILDING_FLOORS_N");             //Кількість поверхів в будинку
	тзЛС.Колонки.Добавить("BUILDING_APARTMENTS_N");         //Кількість квартир в будинку
	тзЛС.Колонки.Добавить("BUILDING_APARTMENTS_PER_FLOOR"); //Кількість квартир на одному поверсі будинку
	тзЛС.Колонки.Добавить("BUILDING_NUMBER");               //Номер будинку
	тзЛС.Колонки.Добавить("ADDRESS_ENTRANCE");              //Номер під’їзду
	тзЛС.Колонки.Добавить("ADDRESS_FLOOR");                 //Поверх
	тзЛС.Колонки.Добавить("ADDRESS_APARTMENT");             //Номер квартири
	тзЛС.Колонки.Добавить("HABITATION_TYPE");               //Тип домоволодіння private – приватний або малоквартирний будинок,
                                                            //condominium – ізольована квартира у багатоквартирному будинку,
                                                            //apartment – кімната у гуртожитку, комунальній квартирі або у будинку
                                                            //            готельного типу
	тзЛС.Колонки.Добавить("DELEGATE_LAST_NAME");            //Прізвище відповідального квартиронаймача
	тзЛС.Колонки.Добавить("DELEGATE_FIRST_NAME");           //Ім’я відповідального квартиронаймача
    тзЛС.Колонки.Добавить("DELEGATE_MIDDLE_NAME");          //По-батькові відповідального квартиронаймача
	тзЛС.Колонки.Добавить("DELEGATE_TAX_CODE");             //ІНН відповідального квартиронаймача
	тзЛС.Колонки.Добавить("DELEGATE_BIRTH_DATE");           //Дата народження відповідального квартиронаймача date(YYYY-MM-DD)
	

	// Выборка ЛС
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК НомерЛС,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Адрес,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.МобТелефон КАК Телефон,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.КодКОАТУУ КАК КОАТУУ,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ДатаРождения КАК ДатаРождения,
	    |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.ИНН КАК ИНН,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.КоличествоПодъездов КАК КоличествоПодъездов,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.КоличествоЭтажей КАК КоличествоЭтажей,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Код КАК Код,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.ЧастныйСектор КАК ЧастныйСектор,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец.МногоКвартирный КАК МногоКвартирный
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&НаДату, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	    |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет";
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	тзЛицСчета = Запрос.Выполнить().Выгрузить();
	Для Каждого стр ИЗ тзЛицСчета Цикл
		Если стр.НомерЛС.Наименование = "9999" ИЛИ стр.НомерЛС.Наименование = "99999" Тогда
			Продолжить;
		Иначе
			ФИО = УправлениеКонтактнойИнформацией.РазложитьСтрокуНаПодстроки(стр.ОтветственныйВладелец, " ");
			Если ФИО.Количество() = 1 Тогда
				Фамилия = ФИО[0];
			КонецЕсли;
			Если ФИО.Количество() = 2 Тогда
				Фамилия = ФИО[0];
				Имя     = ФИО[1];
			КонецЕсли;
			Если ФИО.Количество() = 3 Тогда
				Фамилия  = ФИО[0];
				Имя      = ФИО[1];
				Отчество = ФИО[2];
			КонецЕсли;
			Адрес = УправлениеКонтактнойИнформацией.РазложитьСтрокуНаПодстроки(стр.Адрес, ",");
			Если Адрес[2] = " м.Миргород" ИЛИ Адрес[2] = " м. Миргород" Тогда
				Индекс  = Адрес[4];
				Область = Адрес[3];
				Город   = Адрес[2];
				Улица   = Адрес[1];
				Дом     = Адрес[0];
			Иначе
				//Индекс  = Адрес[5];
				Область = Адрес[4];
				Район   = Адрес[2];
				Город   = Адрес[3];
				Улица   = Адрес[1];
				Дом     = Адрес[0];
			КонецЕсли;
			НовСтрока = тзЛС.Добавить();
			НовСтрока.ACCOUNT_CODE                  = стр.НомерЛС.УникальныйИдентификатор();
			НовСтрока.ACCOUNT_NUMBER                = Строка(стр.НомерЛС);
			НовСтрока.ACCOUNT_STATE                 = "active";
			НовСтрока.LOCALITY_CODE                 = стр.КОАТУУ;
			НовСтрока.DISTRICT_CODE                 = "";
			НовСтрока.AREA_NAME                     = "";
			НовСтрока.STREET_TYPE                   = "";
			НовСтрока.STREET_NAME                   = Улица;
			НовСтрока.BUILDING_POST_CODE            = Индекс;
			Если стр.КоличествоПодъездов = 0 Тогда
				НовСтрока.BUILDING_ENTRANCES_N      = "";
			Иначе
			    НовСтрока.BUILDING_ENTRANCES_N      = стр.КоличествоПодъездов;
			КонецЕсли;
			Если стр.КоличествоЭтажей = 0 Тогда
				НовСтрока.BUILDING_FLOORS_N         = "";
			Иначе
			    НовСтрока.BUILDING_FLOORS_N         = стр.КоличествоЭтажей;
			КонецЕсли;
			НовСтрока.BUILDING_APARTMENTS_N         = "";
			НовСтрока.BUILDING_APARTMENTS_PER_FLOOR = "";
			НовСтрока.BUILDING_NUMBER               = Сред(Дом, 7);
			НовСтрока.ADDRESS_ENTRANCE              = "";
			НовСтрока.ADDRESS_FLOOR                 = "";
			Если стр.Квартира = "кв. №.  0" Тогда
				НовСтрока.ADDRESS_APARTMENT         = "";
			Иначе
			    НовСтрока.ADDRESS_APARTMENT         = Сред(стр.Квартира, 6);
			КонецЕсли;
			Если стр.ЧастныйСектор = Ложь И стр.МногоКвартирный = Ложь Тогда
				НовСтрока.HABITATION_TYPE           = "private";
			КонецЕсли;
			Если стр.ЧастныйСектор = Истина Тогда
			    НовСтрока.HABITATION_TYPE           = "private";
			КонецЕсли;
			Если стр.МногоКвартирный = Истина Тогда
				НовСтрока.HABITATION_TYPE           = "condominium";
			КонецЕсли;
			НовСтрока.DELEGATE_LAST_NAME            = стр.ОтветственныйВладелец; //Фамилия;
			НовСтрока.DELEGATE_FIRST_NAME           = "";
			НовСтрока.DELEGATE_MIDDLE_NAME          = "";
			НовСтрока.DELEGATE_TAX_CODE             = стр.ИНН;
			Если стр.ДатаРождения                   = '00010101' Тогда
				НовСтрока.DELEGATE_BIRTH_DATE       = "";
			Иначе
			    НовСтрока.DELEGATE_BIRTH_DATE       = Формат(стр.ДатаРождения, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			// Очистим переменные
			Фамилия  = "";
			Имя      = "";
			Отчество = "";
			Индекс   = "";
			Область  = "";
			Район    = "";
			Город    = "";
			Улица    = "";
			Дом      = "";
		КонецЕсли;
	КонецЦикла;
	Возврат тзЛС;
КонецФункции

// Контактні дані абонентів, закріплені за особовими рахунками.
Функция КонтактныеДанные() Экспорт
	тзКонтактныеДанные = Новый ТаблицаЗначений;
	тзКонтактныеДанные.Колонки.Добавить("ACCOUNT_CODE");  // УІД особового рахунку абонента
	тзКонтактныеДанные.Колонки.Добавить("PSTN_CODE");     // Телефонний код населеного пункту
	тзКонтактныеДанные.Колонки.Добавить("CONTACT_TYPE");  // Тип контактних даних
														  // enum
													      // Допустимі значення:
														  // cell – мобільний телефон,
														  // pstn – стаціонарний телефон,
														  // phone – телефон невизначеного типу,
														  // phones – декілька телефонів,
														  // mail – електрона пошта
														  // За замовченням дорівнює «phones»
														  // Якщо не ведеться – залишити пустим.
	тзКонтактныеДанные.Колонки.Добавить("CONTACT_DATA");  // Контактні дані (телефон, e-mail)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК НомерЛС,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.МобТелефон КАК Телефон
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = тзКонтактныеДанные.Добавить();
		НовСтрока.ACCOUNT_CODE = Выборка.НомерЛС.УникальныйИдентификатор();
		НовСтрока.PSTN_CODE    = "";
		НовСтрока.CONTACT_TYPE = "cell";
		ДлиннаНомераТелефона = СтрДлина(Выборка.Телефон);
		Если ДлиннаНомераТелефона < 10 Тогда
			НовСтрока.CONTACT_DATA = "";
		Иначе
			НовСтрока.CONTACT_DATA = Выборка.Телефон;
		КонецЕсли;
	КонецЦикла;
	Возврат тзКонтактныеДанные;
КонецФункции

// Дані по діючим послугам, які надаються абонентам по кожному особовому рахунку
Функция УслугиЛицевыхСчетов() Экспорт
	тзУслуги = Новый ТаблицаЗначений;
	тзУслуги.Колонки.Добавить("ACCOUNT_CODE");                          // УІД особового рахунку абонента
	тзУслуги.Колонки.Добавить("PROVIDER_CODE");                         // Код ЕДРПОУ постачальника послуг
	тзУслуги.Колонки.Добавить("INDUSTRY_TYPE");                         // Тип галузі надання послуг 
	                                                                    // house – утримання будинків,
																		// water – водопостачання,
                                                                        // heat – теплопостачання,
                                                                        // garbage – вивіз відходів
	тзУслуги.Колонки.Добавить("GROUP_TYPE");                            // house.maintenance – утримання будинків
																		// water.supply – водопостачання,
																		// water.sewerage – водовідведення,
																		// water.service – сервісні водопровідні послуги,
																		// water.additional – додаткові водопровідні послуги,
																		// heat.heating – опалювання,
																		// heat.water – гаряче водопостачання,
																		// heat.service – сервісні теплові послуги,
																		// heat.additional – додаткові теплові послуги,
																		// garbage.collection – вивіз ТПВ,
	тзУслуги.Колонки.Добавить("SERVICE_TYPE");                          // water.supply.cold – холодна вода,
	                                                                    // water.supply.hot – вода на підігрів,
																		// water.sewerage.cold – стоки хол. води,
                                                                        // water.sewerage.hot – стоки гар. води,
                                                                        // water.service.fee – абонплата за водопостачання
	тзУслуги.Колонки.Добавить("SERVICE_UNIT");							// Одиниця виміру об’єму послуги
	тзУслуги.Колонки.Добавить("CHARACTERISTIC_TYPE");                   // Тип характеристики домоволодіння 
	                                                                    // m3 – метр кубічний
	                                                                    // residentsNumber – кількість мешканців,
                                                                        // livingArea – житлова площа,
                                                                        // heatingArea – площа опалювання
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", НачалоДня(ТекущаяДата()));
	ЛС = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из ЛС Цикл
		ДанныеЛС = ДанныеПоЛС(стр.ЛицевойСчет);
		Для Каждого Услуги Из ДанныеЛС Цикл
			Если ДанныеЛС.Количество() <> 0 Тогда
				НовСтрока = тзУслуги.Добавить();
				НовСтрока.ACCOUNT_CODE = стр.ЛицевойСчет.УникальныйИдентификатор();
				НовСтрока.PROVIDER_CODE = стр.ЛицевойСчет.Владелец.Организация.КодПоЕДРПОУ;
				Если Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000019") Тогда  // Водовідведення холодної води
				    НовСтрока.INDUSTRY_TYPE  = "water";
					НовСтрока.GROUP_TYPE     = "water.sewerage";
					НовСтрока.SERVICE_TYPE   = "water.sewerage.cold";
					НовСтрока.SERVICE_UNIT   = Услуги.ЕдиницаИзмерения.Наименование;
					НовСтрока.CHARACTERISTIC_TYPE = "m3";		
				ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000020") Тогда // Водовідведення гарячої води
					НовСтрока.INDUSTRY_TYPE  = "water";
					НовСтрока.GROUP_TYPE     = "water.sewerage";
					НовСтрока.SERVICE_TYPE   = "water.sewerage.hot";
					Если Услуги.ЕдиницаИзмерения.Наименование = "м3" Тогда
					    НовСтрока.SERVICE_UNIT   = "m3";
					КонецЕсли;
					НовСтрока.CHARACTERISTIC_TYPE = "residentsNumber";			
				// Водовідведення за нормою
			    ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000021") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000149") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000150") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000151") ИЛИ
				          Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000152") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000153") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000154") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000155") ИЛИ
					      Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000162") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000164") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000166") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000172") ИЛИ
					      Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000173") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000174") Тогда
					НовСтрока.INDUSTRY_TYPE  = "water";
					НовСтрока.GROUP_TYPE     = "water.sewerage";
					НовСтрока.SERVICE_TYPE   = "water.sewerage.cold";
					Если Услуги.ЕдиницаИзмерения.Наименование = "м3" Тогда
					    НовСтрока.SERVICE_UNIT   = "m3";
					КонецЕсли;
					НовСтрока.CHARACTERISTIC_TYPE = "residentsNumber";
					
					
				ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000048") Тогда  // Холодне водопостачання за приладами обліку
					НовСтрока.INDUSTRY_TYPE  = "water";
					НовСтрока.GROUP_TYPE     = "water.supply";
				    НовСтрока.SERVICE_TYPE   = "water.supply.cold";
					Если Услуги.ЕдиницаИзмерения.Наименование = "м3" Тогда
					    НовСтрока.SERVICE_UNIT   = "m3";
					КонецЕсли;
					НовСтрока.CHARACTERISTIC_TYPE = "residentsNumber";
				// Водопостачання за нормою
			    ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000049") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000050") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000156") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000157") ИЛИ
				          Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000158") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000159") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000160") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000161") ИЛИ
						  Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000167") ИЛИ Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000171") Тогда
					НовСтрока.INDUSTRY_TYPE  = "water";
					НовСтрока.GROUP_TYPE     = "water.supply";
				    НовСтрока.SERVICE_TYPE   = "water.supply.cold";
					Если Услуги.ЕдиницаИзмерения.Наименование = "м3" Тогда
					    НовСтрока.SERVICE_UNIT   = "m3";
					КонецЕсли;
					НовСтрока.CHARACTERISTIC_TYPE = "residentsNumber";
				// Отопление, Подогрев гарячой воды
			    ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000178") Тогда
				    НовСтрока.INDUSTRY_TYPE  = "heat";
					НовСтрока.GROUP_TYPE     = "heat.heating";
				    НовСтрока.SERVICE_TYPE   = "";
					Если Услуги.ЕдиницаИзмерения.Наименование = "м3" Тогда
					    НовСтрока.SERVICE_UNIT   = "m3";
					КонецЕсли;
					НовСтрока.CHARACTERISTIC_TYPE = "heatingArea";
				ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000179") Тогда
					НовСтрока.INDUSTRY_TYPE  = "water";
					НовСтрока.GROUP_TYPE     = "heat.water";
				    НовСтрока.SERVICE_TYPE   = "water.supply.hot";
					Если Услуги.ЕдиницаИзмерения.Наименование = "м3" Тогда
					    НовСтрока.SERVICE_UNIT   = "m3";
					КонецЕсли;
					НовСтрока.CHARACTERISTIC_TYPE = "residentsNumber";
					
				// Вывоз мусора
				ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("000000038") Тогда
					НовСтрока.INDUSTRY_TYPE  = "garbage";
					НовСтрока.GROUP_TYPE     = "garbage.collection";
				    НовСтрока.SERVICE_TYPE   = "";
					НовСтрока.SERVICE_UNIT   = Услуги.ЕдиницаИзмерения.Наименование;
					НовСтрока.CHARACTERISTIC_TYPE = "residentsNumber";
					
				// ЖЕК
			    ИначеЕсли Услуги.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000181") Тогда
				    НовСтрока.INDUSTRY_TYPE  = "house";
					НовСтрока.GROUP_TYPE     = "house.maintenance";
				    НовСтрока.SERVICE_TYPE   = "";
					НовСтрока.SERVICE_UNIT   = Услуги.ЕдиницаИзмерения.Наименование;
					НовСтрока.CHARACTERISTIC_TYPE = "livingArea";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат тзУслуги;
КонецФункции

// Дані по нарахуванням, сплатам, перерахункам, субсидіям та пільгам зведені у балансову відомость.
Функция БалансыПоЛицевымСчетам() Экспорт
	тзБалансы = Новый ТаблицаЗначений;
	тзБалансы.Колонки.Добавить("ACCOUNT_CODE");
	тзБалансы.Колонки.Добавить("INDUSTRY_TYPE");
	тзБалансы.Колонки.Добавить("GROUP_TYPE");
	тзБалансы.Колонки.Добавить("SERVICE_TYPE");
	тзБалансы.Колонки.Добавить("PROVIDER_CODE");
	тзБалансы.Колонки.Добавить("PERIOD_YEAR");
	тзБалансы.Колонки.Добавить("PERIOD_MONTH");
	тзБалансы.Колонки.Добавить("CALC_BALANCE");
	тзБалансы.Колонки.Добавить("CALC_ACCRUAL");
	тзБалансы.Колонки.Добавить("CALC_PRIVILEGE");
	тзБалансы.Колонки.Добавить("CALC_SUBSIDY");
	тзБалансы.Колонки.Добавить("CALC_PAYMENT");
	тзБалансы.Колонки.Добавить("CALC_RECALC");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК Оплачено,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет.Владелец КАК Здание,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Период КАК Дата,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга КАК Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Месяц, ,) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |АВТОУПОРЯДОЧИВАНИЕ";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтрока = тзБалансы.Добавить();
		НовСтрока.ACCOUNT_CODE       = Выборка.ЛицевойСчет.УникальныйИдентификатор();
		НовСтрока.PROVIDER_CODE      = Выборка.ЛицевойСчет.Владелец.Организация.КодПоЕДРПОУ;
		НовСтрока.PERIOD_YEAR        = Формат(Выборка.Дата, "ДФ=yyyy");
		НовСтрока.PERIOD_MONTH       = Формат(Выборка.Дата, "ДФ=MM");
		НовСтрока.CALC_BALANCE       = Выборка.НачальныйОстаток;
		НовСтрока.CALC_ACCRUAL       = Выборка.Начислено;
		НовСтрока.CALC_PAYMENT       = Выборка.Оплачено;
		НовСтрока.CALC_RECALC        = 0;
		Если Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000019") Тогда  // Водовідведення холодної води
		    НовСтрока.INDUSTRY_TYPE  = "water";
			НовСтрока.GROUP_TYPE     = "water.sewerage";
			НовСтрока.SERVICE_TYPE   = "water.supply.cold";
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000020") Тогда // Водовідведення гарячої води
			НовСтрока.INDUSTRY_TYPE  = "water";
			НовСтрока.GROUP_TYPE     = "water.sewerage";
			НовСтрока.SERVICE_TYPE   = "water.sewerage.hot";
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000021") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000149") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000150") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000151") ИЛИ
		          Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000152") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000153") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000154") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000155") ИЛИ
			      Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000162") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000164") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000166") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000172") ИЛИ
			      Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000173") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000174") Тогда
			НовСтрока.INDUSTRY_TYPE  = "water";
			НовСтрока.GROUP_TYPE     = "water.sewerage";
			НовСтрока.SERVICE_TYPE   = "water.supply.cold";
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000048") Тогда  // Холодне водопостачання за приладами обліку
			НовСтрока.INDUSTRY_TYPE  = "water";
			НовСтрока.GROUP_TYPE     = "water.supply";
		    НовСтрока.SERVICE_TYPE   = "water.supply.cold";
		// Водопостачання за нормою
	    ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000049") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000050") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000156") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000157") ИЛИ
		          Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000158") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000159") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000160") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000161") ИЛИ
				  Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000167") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000171") Тогда
			НовСтрока.INDUSTRY_TYPE  = "water";
			НовСтрока.GROUP_TYPE     = "water.supply";
		    НовСтрока.SERVICE_TYPE   = "water.supply.cold";
		// Отопление, Подогрев гарячой воды
	    ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000178") Тогда
		    НовСтрока.INDUSTRY_TYPE  = "heat";
			НовСтрока.GROUP_TYPE     = "heat.heating";
		    НовСтрока.SERVICE_TYPE   = "";
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000179") Тогда
			НовСтрока.INDUSTRY_TYPE  = "water";
			НовСтрока.GROUP_TYPE     = "heat.water";
		    НовСтрока.SERVICE_TYPE   = "water.supply.hot";
		// Вывоз мусора
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000038") Тогда
			НовСтрока.INDUSTRY_TYPE  = "garbage";
			НовСтрока.GROUP_TYPE     = "garbage.collection";
		    НовСтрока.SERVICE_TYPE   = "";
		// ЖЕК
	    ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000181") Тогда
		    НовСтрока.INDUSTRY_TYPE  = "house";
			НовСтрока.GROUP_TYPE     = "house.maintenance";
		    НовСтрока.SERVICE_TYPE   = "";
		КонецЕсли;
	КонецЦикла;
	Возврат тзБалансы;
КонецФункции

// Дані по сплатам.
Функция ОплатыПоЛицевымСчетам() Экспорт
	тзОплаты = Новый ТаблицаЗначений;
	тзОплаты.Колонки.Добавить("ACCOUNT_CODE");
	тзОплаты.Колонки.Добавить("INDUSTRY_TYPE");
	тзОплаты.Колонки.Добавить("PROVIDER_CODE");
	тзОплаты.Колонки.Добавить("PAY_SOURCE");
	тзОплаты.Колонки.Добавить("PAY_AGENT");
	тзОплаты.Колонки.Добавить("PAY_DATE");
	тзОплаты.Колонки.Добавить("PAY_SUM");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОплатаУслугМВК.Дата,
	    |	ОплатаУслугМВК.ЛицевойСчет,
	    |	ОплатаУслугМВК.ЛицевойСчет.Владелец.Организация.КодПоЕДРПОУ КАК КодЕДРПОУ,
	    |	ОплатаУслугМВК.СуммаПлатежа,
	    |	ОплатаУслугМВК.БанковскийСчет
	    |ИЗ
	    |	Документ.ОплатаУслугМВК КАК ОплатаУслугМВК
	    |ГДЕ
	    |	ОплатаУслугМВК.ПометкаУдаления = ЛОЖЬ
	    |	И ОплатаУслугМВК.Проведен = ИСТИНА";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = тзОплаты.Добавить();
		НовСтрока.ACCOUNT_CODE  = Выборка.ЛицевойСчет.УникальныйИдентификатор();
		НовСтрока.PROVIDER_CODE = Выборка.КодЕДРПОУ;
		Организация = Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ", "03362560");
		Если Выборка.КодЕДРПОУ = Организация.КодПоЕДРПОУ Тогда
			НовСтрока.INDUSTRY_TYPE = "water";
		КонецЕсли;
		НовСтрока.PAY_DATE      = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		НовСтрока.PAY_SUM       = Выборка.СуммаПлатежа;
		НовСтрока.PAY_AGENT     = Выборка.БанковскийСчет.Банк.Наименование;
		НовСтрока.PAY_SOURCE    = "bank";
	КонецЦикла;
	Возврат тзОплаты;
КонецФункции

// Деталізація розрахунків
Функция ДетализацияРасчетовПоЛицевымСчетам() Экспорт
	
КонецФункции

// Дані по приладам обліку та показникам.
Функция ПриборыУчетаЛицевыхСчетов() Экспорт
	тзПриборы = Новый ТаблицаЗначений;
	тзПриборы.Колонки.Добавить("ACCOUNT_CODE");               // УІД особового рахунку абонента
	тзПриборы.Колонки.Добавить("GROUP_TYPE");                 // Тип групи приладів обліку
	                                                          // power – прилади обліку електроенергії,
                                                              // gas – прилади обліку газу,
                                                              // water – прилади обліку води,
                                                              // heat – прилади обліку тепла
	тзПриборы.Колонки.Добавить("GROUP_START_DAY");            // Перший день місяця прийому показників За замовченням дорівнює «1»
	тзПриборы.Колонки.Добавить("GROUP_FINISH_DAY");           // Останній день місяця прийому показників  «-1» дорівнює останньому календарному дню
	тзПриборы.Колонки.Добавить("METER_CODE");                 // УІД приладу обліку
	тзПриборы.Колонки.Добавить("METER_STATE");                // active – діючий прилад обліку,
                                                              // inactive – на обслуговуванні (наприклад у стані повірки),
                                                              // removed – знятий з обліку.
	тзПриборы.Колонки.Добавить("METER_TYPE");                 // Тип приладу обліку
	                                                          // water.cold – прилад обліку холодної води,
                                                              // water.hot – прилад обліку гарячої води,
                                                              // heat.heating – прилад обліку теплової енергії
	тзПриборы.Колонки.Добавить("METER_SERIAL");				  // Заводський номер приладу обліку
	тзПриборы.Колонки.Добавить("METER_MODEL");                // Модель приладу обліку   
	тзПриборы.Колонки.Добавить("METER_CONFIRMED");            // Дата останньої повірки приладу обліку
	тзПриборы.Колонки.Добавить("METER_NCONFIRMD");            // Дата наступної повірки приладу обліку
    тзПриборы.Колонки.Добавить("METER_INTERVAL");             // Міжповірочний інтервал
	тзПриборы.Колонки.Добавить("INDICATOR_TYPE");             // Тип показника
	                                                          // water.cold – витрата холодної води,
                                                              // water.hot – витрата гарячої води
															  // heat.heating – витрата теплової енергії,
                                                              // heat.volume – об’єм теплоносія,
                                                              // heat.t.in – температура подачі,
                                                              // heat.t.out – температура звороту,
                                                              // heat.time – час зняття показань
	тзПриборы.Колонки.Добавить("INDICATOR_UNIT");             // Одиниця виміру показника
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	    |	УправлениеПриборамиУчетаПриборыУчета.ДатаПоследнейПоверки КАК ДатаПоследнейПоверки,
	    |	УправлениеПриборамиУчетаПриборыУчета.ДатаСледующейПоверки КАК ДатаСледующейПоверки,
	    |	УправлениеПриборамиУчетаПриборыУчета.ТипПрибора КАК ТипПрибора,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги КАК ВидУслуги
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК УстановленныеПриборыУчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УправлениеПриборамиУчета.ПриборыУчета КАК УправлениеПриборамиУчетаПриборыУчета
	    |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = УправлениеПриборамиУчетаПриборыУчета.ПриборУчета";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = тзПриборы.Добавить();
		НовСтрока.ACCOUNT_CODE      = Выборка.ЛицевойСчет.УникальныйИдентификатор();
		Если Выборка.Услуга         = Справочники.Услуги.НайтиПоКоду("000000048") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000148") Тогда
		    НовСтрока.GROUP_TYPE    = "water";
		ИначеЕсли Выборка.Услуга    = Справочники.Услуги.НайтиПоКоду("Р00000178") Тогда
			НовСтрока.GROUP_TYPE    = "heat";
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000020") Тогда
			НовСтрока.GROUP_TYPE    = "water";
		КонецЕсли;
		НовСтрока.GROUP_START_DAY   = 1;
		НовСтрока.GROUP_FINISH_DAY  = -1;
		НовСтрока.METER_CODE        = Выборка.ПриборУчета.УникальныйИдентификатор();
		НовСтрока.METER_STATE       = "active";
		Если Выборка.ВидУслуги = Справочники.ВидыУслуг.ХолоднаяВода Тогда
		    НовСтрока.METER_TYPE    = "water.cold";
			НовСтрока.INDICATOR_TYPE= "water.cold";
		ИначеЕсли Выборка.ВидУслуги = Справочники.ВидыУслуг.Водоотведение Тогда
			НовСтрока.METER_TYPE    = "water.hot";
			НовСтрока.INDICATOR_TYPE= "water.hot";
		ИначеЕсли Выборка.ВидУслуги = Справочники.ВидыУслуг.Отопление Тогда
			НовСтрока.METER_TYPE    = "heat.heating";
			НовСтрока.INDICATOR_TYPE= "heat.heating";
		КонецЕсли;
		НовСтрока.METER_SERIAL      = Выборка.ЗаводскойНомер;
		НовСтрока.METER_MODEL       = Выборка.ТипПрибора;
		Если Выборка.ДатаПоследнейПоверки = '00010101' Тогда
			НовСтрока.METER_CONFIRMED   = "";
		Иначе
		    НовСтрока.METER_CONFIRMED   = Выборка.ДатаПоследнейПоверки;
		КонецЕсли;
		Если Выборка.ДатаСледующейПоверки = '00010101' Тогда
			НовСтрока.METER_NCONFIRMD   = "";
		Иначе
		    НовСтрока.METER_NCONFIRMD   = Выборка.ДатаСледующейПоверки;
		КонецЕсли;
		НовСтрока.METER_INTERVAL    = 48;
		Если Выборка.ЕдиницаИзмерения.Наименование = "м3" Тогда
		    НовСтрока.INDICATOR_UNIT    = "m3";
		ИначеЕсли Выборка.ЕдиницаИзмерения.Наименование = "Гкал" Тогда
			//НовСтрока.INDICATOR_UNIT    = "
		КонецЕсли
	КонецЦикла;
	Возврат тзПриборы;
КонецФункции

// Дані по пломбам приладів обліку.
Функция ПломбыПриборовУчета() Экспорт
	
КонецФункции

// Дані по історії показань приладів обліку.
Функция ПоказанияПриборовУчета() Экспорт
	тзПоказания = Новый ТаблицаЗначений;
	тзПоказания.Колонки.Добавить("ACCOUNT_CODE");
	тзПоказания.Колонки.Добавить("GROUP_TYPE");
	тзПоказания.Колонки.Добавить("PACKAGE_INDICATED");
	тзПоказания.Колонки.Добавить("PACKAGE_SOURCE");
	тзПоказания.Колонки.Добавить("INDICATOR_CODE");
	тзПоказания.Колонки.Добавить("INDICATION_PREVENT");
	тзПоказания.Колонки.Добавить("INDICATION_CURRENT");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета.Услуга КАК Услуга,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.Дата,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Показание,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Источник
	    |ИЗ
	    |	Документ.ВводПоказанийПриборовЗаМесяц.Показания КАК ВводПоказанийПриборовЗаМесяцПоказания
	    |ГДЕ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.Проведен = ИСТИНА
	    |	И ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.ПометкаУдаления = ЛОЖЬ";
	//Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ТекущаяДата()));
	//Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтрока = тзПоказания.Добавить();
		НовСтрока.ACCOUNT_CODE = Выборка.ЛицевойСчет.УникальныйИдентификатор();
		Если Выборка.Услуга         = Справочники.Услуги.НайтиПоКоду("000000048") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000148") Тогда
		    НовСтрока.GROUP_TYPE    = "water";
		ИначеЕсли Выборка.Услуга    = Справочники.Услуги.НайтиПоКоду("Р00000178") Тогда
			НовСтрока.GROUP_TYPE    = "heat";
		ИначеЕсли Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("000000020") Тогда
			НовСтрока.GROUP_TYPE    = "water";
		КонецЕсли;
		НовСтрока.PACKAGE_INDICATED = Формат(НачалоМесяца(Выборка.Дата), "ДФ=yyyy.MM.dd");
		НовСтрока.INDICATOR_CODE = Выборка.ПриборУчета.УникальныйИдентификатор();
		НовСтрока.INDICATION_PREVENT = Выборка.ПоказаниеПредыдущее;
		НовСтрока.INDICATION_CURRENT = Выборка.Показание;
		НовСтрока.PACKAGE_SOURCE = "Оператор";
	КонецЦикла;
	Возврат тзПоказания;
КонецФункции

// Зв’язок між показниками приладів обліку і послугами на облік яких вони впливають.
Функция ПриборУчетаУслуга() Экспорт
	
КонецФункции
